app/Services/DatabaseLoader.php

    public function load($locale, $group, $namespace = null): array
    {
        // JSON lines: __('Hello')
        if ($group === '*' && $namespace === '*') {
            return LanguageData::where('locale', $locale)
                ->whereRaw('`key` NOT LIKE "%.%"') // keys without dots
                ->pluck('value', 'key')
                ->toArray();
        }

        // Grouped translations: __('messages.welcome')
        if ($namespace === '*' || $namespace === null) {
            return LanguageData::where('locale', $locale)
                ->where('key', 'like', $group . '.%')
                ->get()
                ->mapWithKeys(function ($item) use ($group) {
                    $key = substr($item->key, strlen($group) + 1);
                    return [$key => $item->value];
                })
                ->toArray();
---
select `value`, `key` from `language_data` where `locale` = 'en' and `key` NOT LIKE "%.%"
select * from `language_data` where `locale` = 'en' and `key` like 'language_data.%'