app/Http/Controllers/admin/LanguageController.php

insert into `language_data` (`locale`, `key`, `value`, `updated_at`, `created_at`) values ('en', 'language_data', 'Languge data', '2025-11-05 04:27:38', '2025-11-05 04:27:38')
select * from `language_data` where (`locale` = 'en' and `key` = 'language_data') limit 1
---
    public function add_language_data(Request $request)
    {
        try {
            $request->validate([
                'keyword' => 'required',
                'value' => 'required',
            ]);
        } catch (\Illuminate\Validation\ValidationException $e) {
            $errors = $e->validator->errors()->first();
            return __request(0, $errors, '');
        }

        $locale = 'en';
        $language = LanguageData::updateOrCreate(
            [
                'locale' => $locale,
                'key' => strtolower($request->keyword),
            ],
            [
                'value' => $request->value,
            ]
        );