app/Repositories/UserRepository.php

    public function findByCredentials(string $identifier)
    {
        return User::where('email', $identifier)
            ->orWhere('username', $identifier)
            ->orWhere('phone', $identifier)
            ->first();
---
select * from `users` where `email` = 'admin' or `username` = 'admin' or `phone` = 'admin' limit 1